stress_test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "5 Concurrent Minoristas"
  defaults:
    headers:
      Content-Type: "application/json"
  payload:
    path: "users.csv"
    fields:
      - "email"
      - "password"
    order: sequence
    skipHeader: true

scenarios:
  - name: "Create Giro Flow"
    flow:
      - post:
          url: "/user/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.token"
              as: "token"
      - think: 1
      - post:
          url: "/giro/create"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            beneficiaryName: "Stress Test User"
            beneficiaryId: "12345678"
            bankId: "2be2d42e-5a2e-4a57-9997-b9378bb7b150"
            accountNumber: "01020102010201020102"
            phone: "04141234567"
            amountInput: 3000
            currencyInput: "COP"
            executionType: "TRANSFERENCIA"