stress_test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 30
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 20
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Create Giro Flow"
    flow:
      - post:
          url: "/user/login"
          json:
            email: "jesusnsegurap@gmail.com"
            password: "12345678"
          capture:
            - json: "$.data.token"
              as: "token"
      - think: 1
      - post:
          url: "/giro/create"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            beneficiaryName: "Stress Test User"
            beneficiaryId: "12345678"
            bankId: "6b858da3-d1d0-45fa-9e06-3871b6168a39"
            accountNumber: "01020102010201020102"
            phone: "04141234567"
            amountInput: 100
            currencyInput: "VES"
            executionType: "TRANSFERENCIA"